#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/koisland/aws_terraform_smk_pipeline/runs/run-nL4RmzNTScRzBkUY

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
aws_iam_policy.s3_policy: Refreshing state... [id=arn:aws:iam::985118252342:policy/s3_policy]
aws_iam_role_policy_attachment.batch_policy_attachment: Refreshing state... [id=batch_role-20230401051803826500000002]
aws_iam_role_policy_attachment.ec2_policy_attachment: Refreshing state... [id=ec2_role-20230401051803799900000001]
aws_iam_role.ecs_job_role: Refreshing state... [id=ecs_job_role]
aws_batch_job_queue.job_queue: Refreshing state... [id=arn:aws:batch:us-west-1:985118252342:job-queue/job_queue]
aws_iam_role.batch_role: Refreshing state... [id=batch_role]
aws_iam_role.ec2_role: Refreshing state... [id=ec2_role]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2_profile]
aws_batch_job_definition.job: Refreshing state... [id=arn:aws:batch:us-west-1:985118252342:job-definition/job:1]
aws_security_group.batch_security_group: Refreshing state... [id=sg-0b745cdf64879c86a]
aws_iam_role_policy_attachment.s3_access_policy_attachment: Refreshing state... [id=ecs_job_role-20230401053832092800000001]
aws_s3_bucket.output: Refreshing state... [id=smk-output]
aws_batch_compute_environment.batch_environment: Refreshing state... [id=batch-environment]
module.snakemake.data.aws_subnets.default: Refreshing...
module.snakemake.data.aws_vpc.default: Refreshing...
module.snakemake.data.aws_subnets.default: Refresh complete after 0s [id=us-west-1]
module.snakemake.data.aws_vpc.default: Refresh complete after 1s [id=vpc-96b76df0]
aws_iam_role.ecs_job_role: Drift detected (update)
aws_s3_bucket.output: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_batch_compute_environment.batch_environment will be destroyed
  # (because aws_batch_compute_environment.batch_environment is not in configuration)
  - resource "aws_batch_compute_environment" "batch_environment" {
      - arn                      = "arn:aws:batch:us-west-1:985118252342:compute-environment/batch-environment" -> null
      - compute_environment_name = "batch-environment" -> null
      - ecs_cluster_arn          = "arn:aws:ecs:us-west-1:985118252342:cluster/batch-environment_Batch_9343588f-2b33-30ef-b421-77d36d696982" -> null
      - id                       = "batch-environment" -> null
      - service_role             = "arn:aws:iam::985118252342:role/batch_role" -> null
      - state                    = "ENABLED" -> null
      - status                   = "VALID" -> null
      - status_reason            = "ComputeEnvironment Healthy" -> null
      - tags                     = {
          - "created-by" = "terraform"
        } -> null
      - tags_all                 = {
          - "created-by" = "terraform"
        } -> null
      - type                     = "MANAGED" -> null

      - compute_resources {
          - bid_percentage     = 0 -> null
          - desired_vcpus      = 0 -> null
          - instance_role      = "arn:aws:iam::985118252342:instance-profile/ec2_profile" -> null
          - instance_type      = [
              - "optimal",
            ] -> null
          - max_vcpus          = 2 -> null
          - min_vcpus          = 0 -> null
          - security_group_ids = [
              - "sg-0b745cdf64879c86a",
            ] -> null
          - subnets            = [
              - "subnet-7da2371b",
              - "subnet-98d273c2",
            ] -> null
          - tags               = {} -> null
          - type               = "EC2" -> null

          - ec2_configuration {
              - image_type = "ECS_AL2" -> null
            }
        }
    }

  # aws_batch_job_definition.job will be destroyed
  # (because aws_batch_job_definition.job is not in configuration)
  - resource "aws_batch_job_definition" "job" {
      - arn                   = "arn:aws:batch:us-west-1:985118252342:job-definition/job:1" -> null
      - container_properties  = jsonencode(
            {
              - command              = []
              - environment          = []
              - image                = "snakemake/snakemake:latest"
              - jobRoleArn           = "arn:aws:iam::985118252342:role/ecs_job_role"
              - memory               = 1024
              - mountPoints          = []
              - resourceRequirements = []
              - secrets              = []
              - ulimits              = []
              - vcpus                = 2
              - volumes              = []
            }
        ) -> null
      - id                    = "arn:aws:batch:us-west-1:985118252342:job-definition/job:1" -> null
      - name                  = "job" -> null
      - parameters            = {} -> null
      - platform_capabilities = [] -> null
      - propagate_tags        = false -> null
      - revision              = 1 -> null
      - tags                  = {
          - "created-by" = "terraform"
        } -> null
      - tags_all              = {
          - "created-by" = "terraform"
        } -> null
      - type                  = "container" -> null
    }

  # aws_batch_job_queue.job_queue will be destroyed
  # (because aws_batch_job_queue.job_queue is not in configuration)
  - resource "aws_batch_job_queue" "job_queue" {
      - arn                  = "arn:aws:batch:us-west-1:985118252342:job-queue/job_queue" -> null
      - compute_environments = [
          - "arn:aws:batch:us-west-1:985118252342:compute-environment/batch-environment",
        ] -> null
      - id                   = "arn:aws:batch:us-west-1:985118252342:job-queue/job_queue" -> null
      - name                 = "job_queue" -> null
      - priority             = 1 -> null
      - state                = "ENABLED" -> null
      - tags                 = {
          - "created-by" = "terraform"
        } -> null
      - tags_all             = {
          - "created-by" = "terraform"
        } -> null
    }

  # aws_iam_instance_profile.ec2_profile will be destroyed
  # (because aws_iam_instance_profile.ec2_profile is not in configuration)
  - resource "aws_iam_instance_profile" "ec2_profile" {
      - arn         = "arn:aws:iam::985118252342:instance-profile/ec2_profile" -> null
      - create_date = "2023-04-01T05:18:03Z" -> null
      - id          = "ec2_profile" -> null
      - name        = "ec2_profile" -> null
      - path        = "/" -> null
      - role        = "ec2_role" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPA6KXM7TU3INBFRZRCE" -> null
    }

  # aws_iam_policy.s3_policy will be destroyed
  # (because aws_iam_policy.s3_policy is not in configuration)
  - resource "aws_iam_policy" "s3_policy" {
      - arn       = "arn:aws:iam::985118252342:policy/s3_policy" -> null
      - id        = "arn:aws:iam::985118252342:policy/s3_policy" -> null
      - name      = "s3_policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:Get*",
                          - "s3:List*",
                          - "s3:Put*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::smk-output",
                          - "arn:aws:s3:::smk-output/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA6KXM7TU3EPWFD25IF" -> null
      - tags      = {
          - "created-by" = "terraform"
        } -> null
      - tags_all  = {
          - "created-by" = "terraform"
        } -> null
    }

  # aws_iam_role.batch_role will be destroyed
  # (because aws_iam_role.batch_role is not in configuration)
  - resource "aws_iam_role" "batch_role" {
      - arn                   = "arn:aws:iam::985118252342:role/batch_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "batch.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-01T05:18:03Z" -> null
      - force_detach_policies = false -> null
      - id                    = "batch_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "batch_role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "created-by" = "terraform"
        } -> null
      - tags_all              = {
          - "created-by" = "terraform"
        } -> null
      - unique_id             = "AROA6KXM7TU3LGUW5HZFZ" -> null
    }

  # aws_iam_role.ec2_role will be destroyed
  # (because aws_iam_role.ec2_role is not in configuration)
  - resource "aws_iam_role" "ec2_role" {
      - arn                   = "arn:aws:iam::985118252342:role/ec2_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-01T05:18:03Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ec2_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ec2_role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "created-by" = "terraform"
        } -> null
      - tags_all              = {
          - "created-by" = "terraform"
        } -> null
      - unique_id             = "AROA6KXM7TU3CVEBBDQMP" -> null
    }

  # aws_iam_role.ecs_job_role will be destroyed
  # (because aws_iam_role.ecs_job_role is not in configuration)
  - resource "aws_iam_role" "ecs_job_role" {
      - arn                   = "arn:aws:iam::985118252342:role/ecs_job_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-01T05:18:03Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ecs_job_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::985118252342:policy/s3_policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ecs_job_role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "created-by" = "terraform"
        } -> null
      - tags_all              = {
          - "created-by" = "terraform"
        } -> null
      - unique_id             = "AROA6KXM7TU3PVGK5WQTX" -> null
    }

  # aws_iam_role_policy_attachment.batch_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.batch_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "batch_policy_attachment" {
      - id         = "batch_role-20230401051803826500000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole" -> null
      - role       = "batch_role" -> null
    }

  # aws_iam_role_policy_attachment.ec2_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.ec2_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ec2_policy_attachment" {
      - id         = "ec2_role-20230401051803799900000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role" -> null
      - role       = "ec2_role" -> null
    }

  # aws_iam_role_policy_attachment.s3_access_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.s3_access_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "s3_access_policy_attachment" {
      - id         = "ecs_job_role-20230401053832092800000001" -> null
      - policy_arn = "arn:aws:iam::985118252342:policy/s3_policy" -> null
      - role       = "ecs_job_role" -> null
    }

  # aws_s3_bucket.output will be destroyed
  # (because aws_s3_bucket.output is not in configuration)
  - resource "aws_s3_bucket" "output" {
      - arn                         = "arn:aws:s3:::smk-output" -> null
      - bucket                      = "smk-output" -> null
      - bucket_domain_name          = "smk-output.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "smk-output.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "smk-output" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_security_group.batch_security_group will be destroyed
  # (because aws_security_group.batch_security_group is not in configuration)
  - resource "aws_security_group" "batch_security_group" {
      - arn                    = "arn:aws:ec2:us-west-1:985118252342:security-group/sg-0b745cdf64879c86a" -> null
      - description            = "AWS Batch Security Group for batch jobs" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - id                     = "sg-0b745cdf64879c86a" -> null
      - ingress                = [] -> null
      - name                   = "batch_security_group" -> null
      - owner_id               = "985118252342" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "created-by" = "terraform"
        } -> null
      - tags_all               = {
          - "created-by" = "terraform"
        } -> null
      - vpc_id                 = "vpc-96b76df0" -> null
    }

  # module.snakemake.aws_batch_compute_environment.standard will be created
  + resource "aws_batch_compute_environment" "standard" {
      + arn                             = (known after apply)
      + compute_environment_name        = "snakemake_standard"
      + compute_environment_name_prefix = (known after apply)
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = (known after apply)
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags                            = {
          + "created-by" = "terraform"
        }
      + tags_all                        = {
          + "created-by" = "terraform"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + instance_role      = (known after apply)
          + instance_type      = [
              + "optimal",
            ]
          + max_vcpus          = 2
          + min_vcpus          = 0
          + security_group_ids = (known after apply)
          + subnets            = [
              + "subnet-7da2371b",
              + "subnet-98d273c2",
            ]
          + type               = "EC2"
        }
    }

  # module.snakemake.aws_batch_job_definition.standard will be created
  + resource "aws_batch_job_definition" "standard" {
      + arn                  = (known after apply)
      + container_properties = (known after apply)
      + id                   = (known after apply)
      + name                 = "snakemake_standard"
      + propagate_tags       = false
      + revision             = (known after apply)
      + tags                 = {
          + "created-by" = "terraform"
        }
      + tags_all             = {
          + "created-by" = "terraform"
        }
      + type                 = "container"
    }

  # module.snakemake.aws_batch_job_queue.main_queue will be created
  + resource "aws_batch_job_queue" "main_queue" {
      + arn                  = (known after apply)
      + compute_environments = (known after apply)
      + id                   = (known after apply)
      + name                 = "snakemake_main_queue"
      + priority             = 1
      + state                = "ENABLED"
      + tags                 = {
          + "created-by" = "terraform"
        }
      + tags_all             = {
          + "created-by" = "terraform"
        }
    }

  # module.snakemake.aws_iam_instance_profile.ec2_profile will be created
  + resource "aws_iam_instance_profile" "ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "snakemake_ec2_profile"
      + path        = "/"
      + role        = "snakemake_ec2_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.snakemake.aws_iam_policy.read_write_s3 will be created
  + resource "aws_iam_policy" "read_write_s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "snakemake_read_write_s3"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "created-by" = "terraform"
        }
      + tags_all  = {
          + "created-by" = "terraform"
        }
    }

  # module.snakemake.aws_iam_role.batch_role will be created
  + resource "aws_iam_role" "batch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "batch.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "snakemake_batch_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by" = "terraform"
        }
      + tags_all              = {
          + "created-by" = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.snakemake.aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "snakemake_ec2_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by" = "terraform"
        }
      + tags_all              = {
          + "created-by" = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.snakemake.aws_iam_role.ecs_job_role will be created
  + resource "aws_iam_role" "ecs_job_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "snakemake_ecs_job_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by" = "terraform"
        }
      + tags_all              = {
          + "created-by" = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.snakemake.aws_iam_role_policy_attachment.batch_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "batch_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"
      + role       = "snakemake_batch_role"
    }

  # module.snakemake.aws_iam_role_policy_attachment.ec2_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ec2_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "snakemake_ec2_role"
    }

  # module.snakemake.aws_iam_role_policy_attachment.s3_access_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "s3_access_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "snakemake_ecs_job_role"
    }

  # module.snakemake.aws_s3_bucket.output will be created
  + resource "aws_s3_bucket" "output" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "snakemake-output"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.snakemake.aws_s3_bucket_public_access_block.output_access will be created
  + resource "aws_s3_bucket_public_access_block" "output_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.snakemake.aws_s3_bucket_server_side_encryption_configuration.output_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "output_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.snakemake.aws_s3_bucket_versioning.output_versioning will be created
  + resource "aws_s3_bucket_versioning" "output_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.snakemake.aws_security_group.batch_standard will be created
  + resource "aws_security_group" "batch_standard" {
      + arn                    = (known after apply)
      + description            = "AWS Batch Security Group for batch jobs."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "snakemake_batch_standard"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "created-by" = "terraform"
        }
      + tags_all               = {
          + "created-by" = "terraform"
        }
      + vpc_id                 = "vpc-96b76df0"
    }

Plan: 16 to add, 0 to change, 13 to destroy.

Changes to Outputs:
  - batch_compute_env_id                = "batch-environment" -> null
  - batch_job_def_id                    = "arn:aws:batch:us-west-1:985118252342:job-definition/job:1" -> null
  - batch_job_queue_id                  = "arn:aws:batch:us-west-1:985118252342:job-queue/job_queue" -> null
  - iam_ec2_inst_profile_id             = "ec2_profile" -> null
  - iam_policy_s3_id                    = "arn:aws:iam::985118252342:policy/s3_policy" -> null
  - iam_role_batch_id                   = "batch_role" -> null
  - iam_role_ec2_id                     = "ec2_role" -> null
  - iam_role_ecs_job_id                 = "ecs_job_role" -> null
  - iam_role_policy_attach_batch_id     = "batch_role-20230401051803826500000002" -> null
  - iam_role_policy_attach_ec2_id       = "ec2_role-20230401051803799900000001" -> null
  - iam_role_policy_attach_s3_access_id = "ecs_job_role-20230401053832092800000001" -> null

```

</details>

*Pushed by: @koisland, Action: `pull_request`*